       IDENTIFICATION          DIVISION.
       PROGRAM-ID.             sample0.
       
       ENVIRONMENT             DIVISION.
       
       DATA                    DIVISION.
       
       PROCEDURE               DIVISION.
       MOOO. 
           DISPLAY "é¿èKÇénÇﬂÇ‹ÇµÇÂÇ§ÅIÅh
           STOP    RUN.
