001000 IDENTIFICATION            DIVISION.
001010 PROGRAM-ID.               ISAM仕入先マスタ作成. 
001020*
001030 ENVIRONMENT               DIVISION. 
001040 INPUT-OUTPUT              SECTION.
001050 FILE-CONTROL.
001060     SELECT  IN-FILE     ASSIGN  "仕入先マスタ.txt"
001070                              ORGANIZATION LINE SEQUENTIAL.
001080     SELECT  SHOHIN-FILE ASSIGN  "ISAM仕入先マスタ"
001090                              ORGANIZATION INDEXED
001100                              ACCESS MODE SEQUENTIAL
001110                              RECORD KEY S-CODE.
001120*
001130 DATA                      DIVISION.
001140 FILE                      SECTION. 
001150 FD  IN-FILE.
001160 01  I-REC                 PIC X(35).
001170*
001180 FD  SHOHIN-FILE.
001190 01  S-REC.
001200     05  S-CODE            PIC X(03).
001210     05                    PIC X(32).
001220* 
001230 WORKING-STORAGE           SECTION.
001240 01  END-FLG               PIC X(01)  VALUE SPACE.   
001250* 
001260 PROCEDURE                 DIVISION.
001270 M000.
001280     OPEN   INPUT  IN-FILE  OUTPUT  SHOHIN-FILE 
001290*
001300     READ  IN-FILE
001310         AT END  MOVE  "E"  TO  END-FLG
001320     END-READ
001330*    
001340 　  PERFORM  UNTIL END-FLG  =  "E"  
001350         WRITE  S-REC  FROM  I-REC 
001360            INVALID  KEY 
001370                DISPLAY "*エラー*" I-REC
001380         END-WRITE
001390*
001400         READ  IN-FILE  
001410             AT END  MOVE  "E"  TO  END-FLG
001420         END-READ 
001430     END-PERFORM
001440*
001450     CLOSE  IN-FILE  SHOHIN-FILE 
001460*    DISPLAY  "♪終了しました♪"
001470 　　STOP  RUN.

