       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      Exercise02.
      *ENVIRMENT        DIVISION.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01 NAME-MESSAGE  PIC X(24) VALUE "éÑÇÕõ¡íıï∂Ç≈Ç∑ÅB".
       PROCEDURE        DIVISION.
            DISPLAY NAME-MESSAGE
       STOP RUN.
         
