       IDENTIFICATION       DIVISION.
       PROGRAM-ID.          Exercise01.
      *ENVIROMENT           DIVISION.
      *DATA                 DIVISION.
      *WORKING-STORAGE      SECTION.
       PROCEDURE            DIVISION.
           DISPLAY  "éÑÇÕõ¡íıï∂Ç≈Ç∑ÅB"
           STOP     RUN.  
